app/controllers/cars_controller.rb

INSERT INTO "cars" ("Cost", "Description", "Make", "Model", "created_at", "in_inventory", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save

UPDATE "cars" SET "year" = ?, "in_inventory" = ?, "updated_at" = ? WHERE "cars"."id" = 2  [["year", 2001], ["in_inventory", true], ["updated_at", Mon, 13 Jan 2014 19:21:31 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @car.update(car_params)