app/controllers/maintenances_controller.rb

  def new
    @car = Car.find(params[:car_id])
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? ORDER BY "cars"."id" ASC LIMIT 1  [["id", 1]]

  def create
    @car = Car.find(params[:car_id])
    @maintenance = @car.maintenances.new(maintenance_params)

    respond_to do |format|
      if @maintenance.save
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? ORDER BY "cars"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "maintenances" ("car_id", "cost", "created_at", "date", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_maintenance
      @car = Car.find(params[:car_id])
      @maintenance = @car.maintenances.find(params[:id])
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? ORDER BY "cars"."id" ASC LIMIT 1  [["id", 1]]
SELECT "maintenances".* FROM "maintenances" WHERE "maintenances"."car_id" = ? AND "maintenances"."id" = ? LIMIT 1  [["car_id", 1], ["id", "1"]]