app/controllers/refuels_controller.rb

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? ORDER BY "cars"."id" ASC LIMIT 1  [["id", 1]]
SELECT "refuels".* FROM "refuels" WHERE "refuels"."car_id" = ?  [["car_id", 1]]
---
  def index
    @car = Car.accessible_by(current_ability).find(params[:car_id])
    @refuels = @car.refuels.all

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? ORDER BY "cars"."id" ASC LIMIT 1  [["id", 1]]
---
  def new
    @car = Car.accessible_by(current_ability).find(params[:car_id])

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? ORDER BY "cars"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "refuels" ("car_id", "created_at", "gallons", "miles", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @car = Cars.accessible_by(current_ability).find(params[:car_id])
    @refuel = @car.refuels.new(refuel_params)
    @refuel.user_id = current_user.id

    respond_to do |format|
      if @refuel.save

UPDATE "refuels" SET "price" = ?, "updated_at" = ? WHERE "refuels"."id" = 1  [["price", #<BigDecimal:7f884d2ecf20,'0.4202E2',18(18)>], ["updated_at", Sun, 19 Jan 2014 01:01:08 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @refuel.update(refuel_params)

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? ORDER BY "cars"."id" ASC LIMIT 1  [["id", 1]]
SELECT "refuels".* FROM "refuels" WHERE "refuels"."car_id" = ? AND "refuels"."id" = ? LIMIT 1  [["car_id", 1], ["id", "1"]]
---
    def set_refuel
      @car = Car.accessible_by(current_ability).find(params[:car_id])
      @refuel = @car.refuels.find(params[:id])